""""""

d = {'a': 1, 'b': 3, 'c': 12}

"""
------------------------------------
1. Добавить любую новую пару ключ-значение в словарь d.
Посмотреть содержимое переменной d

"""
d['z'] = 126

print('#01')
print(d)
print()

"""
------------------------------------
2. Удалить значение ключу 'b'.
Посмотреть содержимое переменной d.

"""

del d['b']

print('#02')
print(d)
print()

"""
------------------------------------
3. Изменить значение по ключу 'b' на 20
Посмотреть содержимое переменной d.

"""

d['b'] = 20

print('#03')
print(d)
print()

"""
------------------------------------
4. Получить значение по ключу 'b'

"""

print('#04')
print(d['b'])
print()

"""
------------------------------------
5. Добавить любую новую пару ключ-значение в словарь d.
Посмотреть содержимое переменной d

"""
d['x'] = 99

print('#05')
print(d)
print()

"""
------------------------------------
6. Удалить значение ключу 'a'.
Посмотреть содержимое переменной d.

"""

del d['a']

print('#06')
print(d)
print()

"""
------------------------------------

7. Изменить значение по ключу 'b' на 11
Посмотреть содержимое переменной d.

"""

d['b'] = 11

print('#07')
print(d)
print()

"""
------------------------------------
8. Получить значение по ключу 'c'

"""

print('#08')
print(d['c'])
print()

"""
------------------------------------
9. Добавить любую новую пару ключ-значение в словарь d.
Посмотреть содержимое переменной d

"""
d['y'] = 333

print('#09')
print(d)
print()

"""
------------------------------------
10. Удалить значение ключу 'b'.
Посмотреть содержимое переменной d.

"""

del d['b']

print('#10')
print(d)
print()

"""
------------------------------------
11. Изменить значение по ключу 'b' на 14
Посмотреть содержимое переменной d.

"""

d['b'] = 14

print('#11')
print(d)
print()

"""
------------------------------------
12. Получить значение по ключу 'c'

"""

print('#12')
print(d['c'])
print()

"""
------------------------------------
13. Добавить любую новую пару ключ-значение в словарь d.
Посмотреть содержимое переменной d

"""

d['w'] = 777

print('#13')
print(d)
print()