""""""

"""
---------------------------------
1. Используя функцию > придумать:
  3 примера когда результат будет равен True
  3 примера когда результат будет равен False

"""
print('#01---------------')

print(100 > 1)
print(1000 > 100)
print(1 > 0.1)

print(1 > 100)
print(100 > 1000)
print(0.1 > 1)

print()

"""
---------------------------------
2. Используя функцию < придумать:
  3 примера когда результат будет равен True
  3 примера когда результат будет равен False
"""

print('#02---------------')

print(9 < 999)
print(900 < 9000)
print(0.999 < 9)

print(999 < 9)
print(9000 < 900)
print(9 < 0.999)

print()

"""
---------------------------------
3. Используя функцию == придумать:
  2 примера когда результат будет равен True
  2 примера когда результат будет равен False


"""

print('#03---------------')

print(0.999 == 0.999)
print('abc' == 'abc')
print('zzz' == 'zzz')

print(0.999 == 'zzz')
print('abc' == 'zzz')
print('zzz' == 0.999)

print()

"""
---------------------------------
4. Используя функцию >= придумать:
  3 примера когда результат будет равен True
  3 примера когда результат будет равен False

"""

print('#04---------------')

print(9 >= 0.999)
print(9000 >= 9000)
print(999 >= 9)

print(999 >= 9000)
print(90 >= 900)
print(9 >= 999)

print()

"""
---------------------------------
5. Используя функцию <= придумать:
  3 примера когда результат будет равен True
  3 примера когда результат будет равен False
"""

print('#05---------------')

print(999 <= 9000)
print(90 <= 900)
print(9 <= 999)

print(9 <= 0.999)
print(9000 <= 900)
print(999 <= 9)

print()

"""
---------------------------------
6. Используя функцию != придумать:
  2 примера когда результат будет равен True
  2 примера когда результат будет равен False


"""

print('#06---------------')

print(0.999 != 'zzz')
print('abc' != 'zzz')
print('zzz' != 0.999)

print(0.999 != 0.999)
print('abc' != 'abc')
print('zzz' != 'zzz')

print()