""""""

"""
Используя and и 2 функции из >  <  <=  >=  ==  !=
"""

"""
-------------------------
1. Создайте 3 условия которые будут истинными (True)
Пример истинного условия: 6 > 3 and 8 != 3

"""

print('#01---------------')

print('b' > 'a' and 'one' != 'two')
print(3 <= 3 and 8 < 80)
print('abc' == 'abc' and 100 >= 99)

print()

"""
-------------------------
2. Создайте 3 условия которые будут ложными (False)

"""

print('#02---------------')

print('b' > 'a' and 'one' == 'two')
print(30 <= 3 and 8 < 80)
print('abc' == 'sub' and 100 >= 99)

print()