""""""

"""
Используя or и 2 функции из >  <  <=  >=  ==  !=
"""

"""
------------------------------------
1. Создайте 3 условия которые будут истинными (True)
Пример истинного условия: 7 > 2 or 8 == 3

"""

print('#01---------------')

print('b' > 'a' or 'one' != 'two')
print(3 <= 3 or 8 < 80)
print('abc' == 'abc' and 100 >= 99)

print()

"""
------------------------------------
2. Создайте 3 условия которые будут ложными (False)

"""

print('#02---------------')

print('b' < 'a' or 'one' == 'two')
print(30 <= 3 or 8 > 80)
print('abc' != 'abc' or 1 >= 99)

print()