""""""

"""
Написать функцию которая получает строку (любую) а затем печатает её 3 раза.
"""

str1 = 'бла'


def bla_bla_bla(string_01):

    print(string_01 + ' ' + string_01 + ' ' + string_01)


bla_bla_bla(str1)


"""
Написать функцию которая получает имя пользователя а потом приветствует его.
"""

user = 'John Doe'


def greet_user(user_name):

    print('Hello ' + user_name)


greet_user(user)
