""""""

"""
Написать функцию которая спрашивает имя пользователя а потом приветствует его.
"""

def door_keeper():

    user_name = input('Назовите ваше имя: ')
    print('Здравствуйте, ' + user_name)


door_keeper()


