i = 1

# 01 Вычесть из 14 число 7
x = 14 - 7
print(str(i) + ') ' + str(x))
i = i + 1


# 02 Умножить 18 на 9
x = 18 * 9
print(str(i) + ') ' + str(x))
i = i + 1


# 03 Сложить 14 и 1
x = 14 + 1
print(str(i) + ') ' + str(x))
i = i + 1


# 04 Вычислить остаток от деления 24 на 8
x = 24 % 8
print(str(i) + ') ' + str(x))
i = i + 1


# 05 Разделить 21 на 4
x = 21 / 4
print(str(i) + ') ' + str(x))
i = i + 1


# 06 Умножить 15 на 18
x = 15 * 18
print(str(i) + ') ' + str(x))
i = i + 1


# 07 Сложить 1 и 17
x = 1 + 17
print(str(i) + ') ' + str(x))
i = i + 1


# 08 Вычислить остаток от деления 28 на 5
x = 28 % 5
print(str(i) + ') ' + str(x))
i = i + 1


# 09 Вычесть из 2 число 8
x = 2 - 8
print(str(i) + ') ' + str(x))
i = i + 1


# 10 Разделить 22 на 9
x = 22 / 9
print(str(i) + ') ' + str(x))
i = i + 1


# 11 Вычесть из 9 число 5
x = 9 - 5
print(str(i) + ') ' + str(x))
i = i + 1


# 12 Вычислить остаток от деления 21 на 3
x = 21 % 3
print(str(i) + ') ' + str(x))
i = i + 1


# 13 Сложить 14 и 19
x = 14 + 19
print(str(i) + ') ' + str(x))
i = i + 1


# 14 Разделить 23 на 6
x = 23 / 6
print(str(i) + ') ' + str(x))
i = i + 1


# 15 Умножить 5 на 14
x = 5 * 14
print(str(i) + ') ' + str(x))
i = i + 1


# 16 Вычесть из 12 число 12
x = 12 - 12
print(str(i) + ') ' + str(x))
i = i + 1


# 17 Умножить 10 на 18
x =  10 * 18
print(str(i) + ') ' + str(x))
i = i + 1


# 18 Разделить 25 на 4
x = 25 / 4
print(str(i) + ') ' + str(x))
i = i + 1


# 19 Вычислить остаток от деления 24 на 10
x = 24 % 10
print(str(i) + ') ' + str(x))
i = i + 1


# 20 Сложить 19 и 16
x = 19 + 16
print(str(i) + ') ' + str(x))
i = i + 1


# 21 Вычислить остаток от деления 22 на 8
x = 22 / 8
print(str(i) + ') ' + str(x))
i = i + 1


# 22 Умножить 11 на 16
x = 11 * 16
print(str(i) + ') ' + str(x))
i = i + 1


# 23 Сложить 8 и 10
x = 8 + 10
print(str(i) + ') ' + str(x))
i = i + 1


# 24 Разделить 23 на 9
x = 23 / 9
print(str(i) + ') ' + str(x))
i = i + 1


# 25 Вычесть из 11 число 14
x = 11 - 14
print(str(i) + ') ' + str(x))
i = i + 1


# 26 Умножить 7 на 13
x = 7 * 13
print(str(i) + ') ' + str(x))
i = i + 1


# 27 Сложить 19 и 16
x = 19 + 16
print(str(i) + ') ' + str(x))
i = i + 1


# 28 Разделить 22 на 3
x = 22 / 3
print(str(i) + ') ' + str(x))
i = i + 1


# 29 Вычислить остаток от деления 24 на 10
x = 24 % 10
print(str(i) + ') ' + str(x))
i = i + 1


# 30 Вычесть из 8 число 10
x = 8 - 10
print(str(i) + ') ' + str(x))
i = i + 1


# 31 Вычесть из 8 число 20
x = 8 - 20
print(str(i) + ') ' + str(x))
i = i + 1


# 32 Разделить 22 на 10
x = 22 / 10
print(str(i) + ') ' + str(x))
i = i + 1


# 33 Сложить 18 и 13
x = 18 + 13
print(str(i) + ') ' + str(x))
i = i + 1


# 34 Вычислить остаток от деления 26 на 4
x = 26 % 4
print(str(i) + ') ' + str(x))
i = i + 1


# 35 Умножить 20 на 4
x = 20 * 4
print(str(i) + ') ' + str(x))
i = i + 1


# 36 Вычислить остаток от деления 21 на 4
x = 21 % 4
print(str(i) + ') ' + str(x))
i = i + 1


# 37 Умножить 3 на 18
x = 3 * 18
print(str(i) + ') ' + str(x))
i = i + 1


# 38 Сложить 3 и 2
x = 3 + 2
print(str(i) + ') ' + str(x))
i = i + 1


# 39 Вычесть из 16 число 8
x = 16 - 8
print(str(i) + ') ' + str(x))
i = i + 1


# 40 Разделить 27 на 6
x = 27 / 6
print(str(i) + ') ' + str(x))
i = i + 1


# 41 Вычислить остаток от деления 26 на 5
x = 26 % 5
print(str(i) + ') ' + str(x))
i = i + 1


# 42 Сложить 10 и 11
x = 10 + 11
print(str(i) + ') ' + str(x))
i = i + 1


# 43 Вычесть из 19 число 16
x = 19 - 16
print(str(i) + ') ' + str(x))
i = i + 1


# 44 Умножить 1 на 11
x = 1 * 11
print(str(i) + ') ' + str(x))
i = i + 1


# 45 Разделить 21 на 10
x = 21 / 10
print(str(i) + ') ' + str(x))
i = i + 1

